Tekla Open API Reference for Tekla Structures 2025
Distance Class
 The Distance class contains methods for calculating the distance between geometric objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Distance
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class Distance
<SerializableAttribute>
Public NotInheritable Class Distance
The Distance type exposes the following members.
Methods
Name | Description
PointToLine
 Returns the distance between the given point and line.
PointToLineSegment
 Returns the distance between the given point and line segment.
PointToPlane
 Returns the distance between the given point and plane.
PointToPoint
 Returns the distance between the given two points.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace